package alg

import "testing"

/*
Хоёр шонд тус бүр N, M ширхэг цагираг өлгөсөн байна.
2 тоглогч ээлжлэн нэг удаад аль нэг шонгоос 1 эсвэл хоёулангаас 1, 1 цагирагийг сугалан тоглоно.
Шонгуудаас хамгийн сүүлийн цагирагыг авсан тоглогч хожигдох болно.
Өгөгдсөн N,M хосын хувьд эхэлж сугалсан тоглогч гарцаагүй хожих эсэхийг шалгах програм.
*/

/*  x, y - шонд үлдсэн цагирагийн тоо
 *  step - нүүдлийн тоо
 */
func take(x int, y int, step int) bool {

	if x == 0 || y == 0 {
		/* Аль нэг шонгийн цагираг дууссан бол
		   хожил/хожигдолыг тооцоход хялбархан */
		return ((x+y)%2 == step%2)
	}

	if step%2 == 0 {
		// A тоглогч цагираг авах хувилбарууд
		return (take(x-1, y, step+1) &&
			take(x-1, y-1, step+1) &&
			take(x, y-1, step+1))
	}

	// B тоглогч цагираг авах хувилбарууд
	return (take(x-1, y, step+1) ||
		take(x-1, y-1, step+1) ||
		take(x, y-1, step+1))
}

/* Функцийг турших үндсэн програм */
func TestTakeGame(t *testing.T) {
	/* (7,7) хосын хувьд А тоглогч хожих эсэхийг шалгах */
	println("A тоглогч хожих уу? ")
	if take(7, 7, 1) {
		println("тийм")
	} else {
		println("үгүй")
	}
}
